Catalogs/НастройкиИнтеграцииМаркетплейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиИнтеграцииМаркетплейс</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКабинета</Name>
					<Comment>businessID на Яндекс.Маркет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогЗагружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПлатежногоАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаАвтозагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СкладыМаркетплейс</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСклада</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторКабинета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСклада</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСкладовМаркетплейс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКонтрагентаДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВыкупыПоДоговорамКомиссионера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыкупыПоДоговорамКомиссионера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКомиссионера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВыкупа</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НастройкиИнтеграцииМаркетплейс/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоВыгрузкаОстатков = Параметры.ВидОперации = "ВыгрузкаОстатков";
	ЭтоЗагрузкаКаталога = Параметры.ВидОперации = "ЗагрузкаКаталога";
	
	Если Параметры.Свойство("СкрытьАвтозагрузку") Тогда
		СкрытьАвтозагрузку = Параметры.СкрытьАвтозагрузку;
	КонецЕсли;
		
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Параметры.Свойство("ВидМаркетплейса") Тогда
			Объект.ВидМаркетплейса = Параметры.ВидМаркетплейса;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ВидМаркетплейса) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
				Объект.Контрагент = ОбменСМаркетплейс.КонтрагентМаркетплейсаПоУмолчанию(Объект.ВидМаркетплейса);
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.Контрагент)
				И ЗначениеЗаполнено(Объект.Владелец)
				И НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента)
				И (Объект.ВидМаркетплейса <> Перечисления.ВидыМаркетплейсов.OZON
					Или ИнтеграцияOzon.ЭтоЕдинственныйМагазинOzon(Объект.Владелец, Объект.Ссылка)) Тогда
				РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(Объект.ДоговорКонтрагента, Объект.Контрагент, Объект.Владелец,
					ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером));
			КонецЕсли;
			Объект.Наименование = Объект.ВидМаркетплейса;
		КонецЕсли;
		Объект.ДатаНачалаАвтозагрузки = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
		
		Элементы.ИсторияКонтрагента.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Владелец.Видимость = Не ЗначениеЗаполнено(Объект.Владелец)
		И Справочники.Организации.ИспользуетсяНесколькоОрганизаций();
		
	Заголовок = СтрШаблон(НСтр("ru = 'Настройки интеграции с %1'"),
		Строка(Объект.ВидМаркетплейса));
		
	Элементы.ВидМаркетплейса.Видимость = Не ЗначениеЗаполнено(Объект.ВидМаркетплейса);
	
	МассивПараметров = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидДоговора", ПолучитьВидыДоговора());
	МассивПараметров.Добавить(НовыйПараметр);
	
	Элементы.СкладМаркетплейса.АвтоВыборНезаполненного = ЭтоВыгрузкаОстатков;
	Элементы.Контрагент.АвтоОтметкаНезаполненного = ЭтоЗагрузкаКаталога ИЛИ ЭтоВыгрузкаОстатков;
	
	Элементы.ДоговорКонтрагента.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	ЗаполнитьНастройкиАвтозагрузки();
	
	УстановитьУсловноеОформление();
	
	Если Объект.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.Wildberries Тогда
		ЗаполнитьДанныеТокенаВБ();
	КонецЕсли;
	
	УправлениеФормой();
	
	Если Параметры.Ключ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.Wildberries Тогда
		ТокенАПИ_ВБ = УникальныйИдентификатор;
	ИначеЕсли Объект.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.OZON Тогда
		ИдентификаторКлиента = ИнтеграцияOZON.ПрочитатьКлиентИд(Объект.Ссылка);
		КлючОзон = УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьНастройкаИнтеграцииМаркетплейс", Объект.Ссылка);
	
	Если ПараметрыЗаписи.Свойство("ВключенаФункциональностьМаркетплейс") Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.Wildberries") Тогда
		ПроверяемыеРеквизиты.Добавить("ТокенАПИ_ВБ");
	ИначеЕсли Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.OZON") Тогда
		ПроверяемыеРеквизиты.Добавить("КлючОзон");
		ПроверяемыеРеквизиты.Добавить("ИдентификаторКлиента");
	КонецЕсли;
	
	Если (ЭтоВыгрузкаОстатков ИЛИ ЭтоЗагрузкаКаталога) И Объект.Контрагент.Пустая() Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Контрагент'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Контрагент", "Объект.Контрагент", Отказ);
	КонецЕсли;
	
	Если ЭтоВыгрузкаОстатков 
		И НЕ ЗначениеЗаполнено(Объект.НаименованиеСклада) 
		И СписокСкладовЗагружен Тогда
		
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Склад FBS'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "СкладМаркетплейса", "Объект.НаименованиеСклада", Отказ);
	КонецЕсли;
	
	Если Объект.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.OZON
		И Не ЭтоЗагрузкаКаталога
		И Не ЭтоВыгрузкаОстатков Тогда
		РезультатПроверки = ПроверитьДоговорМагазинаOzon(
			Объект.Владелец, Объект.Ссылка, Объект.ДоговорКонтрагента);
		Если Не РезультатПроверки.ДоговорУникален Тогда
			ОбщегоНазначения.СообщитьПользователю(РезультатПроверки.ТекстСообщения,, "ДоговорКонтрагента", "Объект", Отказ);
		КонецЕсли;
		РезультатПроверки = ПроверитьУникальностьИдентификатораКлиентаOZON(
			Объект.Владелец, Объект.Ссылка, ИдентификаторКлиента);
		Если Не РезультатПроверки.ИдентификаторКлиентаУникален Тогда
			ОбщегоНазначения.СообщитьПользователю(РезультатПроверки.ТекстСообщения,, "ИдентификаторКлиента",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// для новой настройки интеграции принудительно добавим (в случае отсутствия)
	// настройку автозагрузки, по соответствующей маркетплейсу периодичности
	Если ТекущийОбъект.Ссылка.Пустая()
		И Не РегистрыСведений.НастройкиАвтозагрузкиОтчетовМаркетплейсов.ПодключенаАвтозагрузкаДляМаркетплейса(Объект.ВидМаркетплейса) Тогда
		ПараметрыЗаписи.Вставить("ЗаписатьПараметрыАвтозагрузки", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ДанныеАвторизацииOZONИзменены Тогда
		ИнтеграцияOZON.СохранитьНастройкиАвторизации(ТекущийОбъект.Ссылка, КлючОзон, ИдентификаторКлиента);
		ДанныеАвторизацииOZONИзменены = Ложь;
	КонецЕсли;
	
	Если ТокенАПИ_ВБИзменен Тогда
		ИнтеграцияWildberries.СохранитьНастройкиАвторизации(ТекущийОбъект.Ссылка, ТокенАПИ_ВБ);
		ТокенАПИ_ВБИзменен = Ложь;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ЗаписатьПараметрыАвтозагрузки") Тогда
		РегистрыСведений.НастройкиАвтозагрузкиОтчетовМаркетплейсов.СохранитьНастройкиПоУмолчанию(
			ТекущийОбъект.ВидМаркетплейса);
		ЗаполнитьНастройкиАвтозагрузки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если (ЭтоВыгрузкаОстатков ИЛИ ЭтоЗагрузкаКаталога) И НЕ Объект.Ссылка.Пустая() Тогда
		ЗаполнитьСписокСкладовМаркетплейс();
		ПодключитьОбработчикОжидания("ПредложитьЗаполнитьРеквизиты",0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПараметрыАвтозагрузкиОтчетовМаркетплейсовИзменены" Тогда
		ЗаполнитьНастройкиАвтозагрузки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаполнитьРеквизиты()
	Если ЭтоВыгрузкаОстатков И НЕ ЗначениеЗаполнено(Объект.НаименованиеСклада) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Склад FBS'"),,,
			НСтр("ru = 'Для управления остатками необходимо указать склад маркетплейса'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "СкладМаркетплейса", "Объект.НаименованиеСклада");
	КонецЕсли;
	
	Если Объект.Контрагент.Пустая() Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Контрагент'"),,,
			НСтр("ru = 'Для управления остатками необходимо указать контрагента маркетплейса'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Контрагент", "Объект.Контрагент");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ПриИзмененииКонтрагентаСервер();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ПриИзмененииКонтрагентаСервер();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	ДоговорКонтрагентаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыДоговора = Новый Структура;
	ПараметрыДоговора.Вставить("Организация", Объект.Владелец);
	ПараметрыДоговора.Вставить("Владелец", Объект.Контрагент);
	ПараметрыДоговора.Вставить("ВидДоговора", ПолучитьВидыДоговора());
	
	РаботаСДоговорамиКонтрагентовБПКлиент.ДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, ПараметрыДоговора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КлючОзонПриИзменении(Элемент)
	КлючОзон = ОбщегоНазначенияБПКлиентСервер.УдалитьАртефактыВставкиИзБуфера(КлючОзон);
	ДанныеАвторизацииOZONИзменены = Истина;
	ЗаполнитьСписокСкладовМаркетплейс();
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторКлиентаOZONПриИзменении(Элемент)
	ИдентификаторКлиента = ОбщегоНазначенияБПКлиентСервер.УдалитьАртефактыВставкиИзБуфера(ИдентификаторКлиента);
	ДанныеАвторизацииOZONИзменены = Истина;
	Объект.ИдентификаторКабинета = ИдентификаторКлиента;
	ЗаполнитьСписокСкладовМаркетплейс();
КонецПроцедуры

&НаКлиенте
Процедура ТокенВБПриИзменении(Элемент)
	ТокенАПИ_ВБ = ОбщегоНазначенияБПКлиентСервер.УдалитьАртефактыВставкиИзБуфера(ТокенАПИ_ВБ);
	ТокенАПИ_ВБИзменен = Истина;
	ЗаполнитьСписокСкладовМаркетплейс();
	ЗаполнитьДанныеТокенаВБ(ТокенАПИ_ВБ);
КонецПроцедуры

&НаКлиенте
Процедура ВидМаркетплейсаПриИзменении(Элемент)
	КлючАПИ = "";
	ИдентификаторКлиента = "";
	
	Если ЗначениеЗаполнено(Объект.ВидМаркетплейса) Тогда
		Объект.Наименование = Объект.ВидМаркетплейса;
	КонецЕсли;
	
	ЗаполнитьНастройкиАвтозагрузки();
	
	ДанныеАвторизацииOZONИзменены = Не Объект.Ссылка.Пустая();
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СообщитьОпроблеме(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	РаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаАвтозагрузки(Команда)
	
	ОбменСМаркетплейсКлиент.ОткрытьНастройкиАвтозагрузкиОтчетовМаркетплейсов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьНастройкуАвтозагрузки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВключитьАвтозагрузку", Истина);
	
	ОбменСМаркетплейсКлиент.ОткрытьНастройкиАвтозагрузкиОтчетовМаркетплейсов(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыкупыПоДоговоруКомиссионера(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ДоговорКомиссионера", Объект.ДоговорКонтрагента);
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("РегистрСведений.ВыкупыПоДоговорамКомиссионера.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СкладМаркетплейса");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СписокСкладовЗагружен", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.НаименованиеСклада", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

КонецПроцедуры 

&НаСервере
Процедура УправлениеФормой()
	ЭтоВайлдберриз = Объект.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.Wildberries;
	ЭтоОЗОН = Объект.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.OZON;
	ЭтоЯндекс = Объект.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.ЯндексМаркет;
	
	Элементы.ГруппаСкладМаркетплейса.Видимость = ЭтоВыгрузкаОстатков;
	
	Элементы.ГруппаВайлдберриз.Видимость = ЭтоВайлдБерриз;
	
	Элементы.ИдентификаторКлиентаOZON.АвтоОтметкаНезаполненного = ЭтоОЗОН;
	Элементы.КлючОзон.АвтоОтметкаНезаполненного = ЭтоОЗОН;
	Элементы.ГруппаОзон.Видимость = ЭтоОЗОН;
	
	Элементы.ГруппаЯндексМаркет.Видимость = ЭтоЯндекс;
	
	Элементы.ГруппаАвтозагрузка.Видимость = Не СкрытьАвтозагрузку;
	Элементы.ГруппаСообщитьОПроблеме.Видимость = Не СкрытьАвтозагрузку;
	Элементы.ГруппаДатаНачалаАвтозагрузки.Видимость = Не СкрытьАвтозагрузку;
	
	Элементы.ФормаВыкупыПоДоговоруКомиссионера.Видимость = ЭтоОЗОН;
	
	Если Объект.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.OZON
		И Не ИнтеграцияOzon.ЭтоЕдинственныйМагазинOzon(Объект.Владелец, Объект.Ссылка) Тогда
		Элементы.ДоговорКонтрагента.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Иначе
		Элементы.ДоговорКонтрагента.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = РаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
	ПараметрыПисьма.Получатель = "bp@1c.ru";
	ПараметрыПисьма.Тема = НСтр("ru='Нужна интеграция с маркетплейсом'");
	ПараметрыПисьма.Текст = НСтр("ru='Укажите, с каким маркетплейсом нужна интеграция?
		|'");
	ОтправкаПочтовыхСообщенийКлиент.ДополнитьПараметрыПисьмаДляОтправкиЛегкойПочтой(ПараметрыПисьма);
	РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыПисьма);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКонтрагентаСервер()
	Если Объект.ВидМаркетплейса <> Перечисления.ВидыМаркетплейсов.OZON
		Или ИнтеграцияOzon.ЭтоЕдинственныйМагазинOzon(Объект.Владелец, Объект.Ссылка) Тогда
		РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(Объект.ДоговорКонтрагента, Объект.Контрагент, Объект.Владелец,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПолучитьВидыДоговора()));
	КонецЕсли;
		
	Справочники.НастройкиИнтеграцииМаркетплейс.УстановитьАктуальноеЗначениеИсторияКонтрагентаДоговора(
		Объект.Контрагент , Объект.ДоговорКонтрагента, Объект.ИсторияКонтрагентаДоговора);
КонецПроцедуры

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()
	Справочники.НастройкиИнтеграцииМаркетплейс.УстановитьАктуальноеЗначениеИсторияКонтрагентаДоговора(
		Объект.Контрагент , Объект.ДоговорКонтрагента, Объект.ИсторияКонтрагентаДоговора);
КонецПроцедуры

&НаКлиенте
Процедура ТокенВБРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СсылкаНаСправкуВБ = "https://seller.wildberries.ru/supplier-settings/access-to-api";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СсылкаНаСправкуВБ);
КонецПроцедуры

&НаКлиенте
Процедура КлючОзонРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СсылкаНаСправкуOZON = "https://seller.ozon.ru/app/settings/api-keys";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СсылкаНаСправкуOZON);
КонецПроцедуры

&НаСервере
Функция ПолучитьВидыДоговора()
	
	Если Объект.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.ЯндексМаркет Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	КонецЕсли;
	
	Возврат Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокСкладовМаркетплейс()
	Если НЕ ЭтоВыгрузкаОстатков Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() 
		ИЛИ ДанныеАвторизацииOZONИзменены 
		ИЛИ ТокенАПИ_ВБИзменен Тогда
		
		Записать();
	КонецЕсли;
	
	Элементы.СкладМаркетплейса.СписокВыбора.Очистить();
	
	СписокСкладовМаркетплейс = СписокСкладовМаркетплейс(Объект.Ссылка);
	Если СписокСкладовМаркетплейс = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СписокСкладовЗагружен = СписокСкладовМаркетплейс.Количество() > 0;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСписок(Элементы.СкладМаркетплейса.СписокВыбора, СписокСкладовМаркетплейс);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокСкладовМаркетплейс(НастройкаИнтеграции)
	Возврат ОбменСМаркетплейс.СписокСкладовМаркетплейс(НастройкаИнтеграции);
КонецФункции

&НаКлиенте
Процедура СкладМаркетплейсаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ЗначениеСклада = Элементы.СкладМаркетплейса.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Если ЗначениеСклада = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИдентификаторСклада = ЗначениеСклада.Значение;
	Объект.НаименованиеСклада = ЗначениеСклада.Представление;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияКонтрагентаНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("ТекущийКонтрагент, ТекущийДоговорКонтрагента, Организация, ИсторияКонтрагентаДоговора, ТолькоПросмотр", 
					Объект.Контрагент, Объект.ДоговорКонтрагента, Объект.Владелец, Объект.ИсторияКонтрагентаДоговора, ТолькоПросмотр);
	
	ОткрытьФорму("Справочник.НастройкиИнтеграцииМаркетплейс.Форма.РедактированиеИсторииКонтрагента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Справочник.НастройкиИнтеграцииМаркетплейс.Форма.РедактированиеИсторииКонтрагента") Тогда
		
		УстановитьКонтрагентаПослеРедактированияИстории(ВыбранноеЗначение.ИсторияКонтрагентаДоговора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКонтрагентаПослеРедактированияИстории(НаборЗаписей)
	
	Модифицированность = Истина;
	
	НаборЗаписей.Сортировать("Период");
	
	Объект.ИсторияКонтрагентаДоговора.Очистить();
	Если НаборЗаписей.Количество() > 1 Тогда
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			ЗаписьИстории = Объект.ИсторияКонтрагентаДоговора.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьИстории, ЗаписьНабора);
		КонецЦикла;
	КонецЕсли;
	
	Объект.Контрагент = НаборЗаписей[НаборЗаписей.Количество()-1].Контрагент;
	Объект.ДоговорКонтрагента = НаборЗаписей[НаборЗаписей.Количество()-1].ДоговорКонтрагента;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиАвтозагрузки()
	
	Если ЭтоВыгрузкаОстатков Или ЭтоЗагрузкаКаталога Тогда
		Элементы.ГруппаАвтозагрузка.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Справочники.НастройкиИнтеграцииМаркетплейс.ЗаполнитьНастройкиАвтозагрузки(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТокенаВБ(Токен = Неопределено)
	
	Если Токен = Неопределено Тогда
		ДанныеТокенаВБ = ИнтеграцияWildberries.ДанныеТокенаПоНастройкеИнтеграции(Объект.Ссылка);
	Иначе
		ДанныеТокенаВБ = ИнтеграцияWildberries.ДанныеТокена(Токен);
	КонецЕсли;
	
	НадписьНоваяСтрока = Новый ФорматированнаяСтрока(Символы.ПС);
	НадписьПустаяСтрока = Новый ФорматированнаяСтрока(Символы.ПС, Символы.ПС);
	ЖирныйШрифт = Новый Шрифт(,, Истина);
	
	Если ЗначениеЗаполнено(ДанныеТокенаВБ.ТекстОшибки) Тогда
		НадписьСостояниеТокена = Новый ФорматированнаяСтрока(ДанныеТокенаВБ.ТекстОшибки,,
			ЦветаСтиля.РезультатПроблемаЦвет);
	Иначе
		НадписьСостояниеТокена = Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = 'Действует до %1'"), Формат(ДанныеТокенаВБ.СрокДействия, "ДФ=dd.MM.yyyy")),,
			ЦветаСтиля.АктуальнаяПодпискаЦвет);
	КонецЕсли;
	
	НадписьКатегории = Новый Массив;
	Если ЗначениеЗаполнено(ДанныеТокенаВБ.Категории) Тогда
		НадписьКатегории.Добавить(НадписьПустаяСтрока);
		Если ДанныеТокенаВБ.Категории.Количество() = 1 Тогда
			НадписьКатегории.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Доступная категория: '")));
		Иначе
			НадписьКатегории.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Доступные категории: '")));
		КонецЕсли;
		НадписьКатегории.Добавить(НадписьНоваяСтрока);
		НадписьКатегории.Добавить(Новый ФорматированнаяСтрока(СтрСоединить(ДанныеТокенаВБ.Категории, ", "), ЖирныйШрифт));
	КонецЕсли;
	
	НадписьДоступно = Новый Массив;
	Если ЗначениеЗаполнено(ДанныеТокенаВБ.ДоступнаяФункциональность) Тогда
		НадписьДоступно.Добавить(НадписьПустаяСтрока);
		НадписьДоступно.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Доступно:'"),, ЦветаСтиля.АктуальнаяПодпискаЦвет));
		Для Каждого Функциональность Из ДанныеТокенаВБ.ДоступнаяФункциональность Цикл
			НадписьДоступно.Добавить(НадписьНоваяСтрока);
			НадписьДоступно.Добавить(Новый ФорматированнаяСтрока(Функциональность.Наименование, ЖирныйШрифт));
		КонецЦикла;
	КонецЕсли;
	
	НадписьНедоступно = Новый Массив;
	Если ЗначениеЗаполнено(ДанныеТокенаВБ.НедоступнаяФункциональность) Тогда
		НадписьНедоступно.Добавить(НадписьПустаяСтрока);
		НадписьНедоступно.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Не доступно:'"),, ЦветаСтиля.РезультатПроблемаЦвет));
		Для Каждого Функциональность Из ДанныеТокенаВБ.НедоступнаяФункциональность Цикл
			НадписьНедоступно.Добавить(НадписьНоваяСтрока);
			НадписьНедоступно.Добавить(Новый ФорматированнаяСтрока(Функциональность.Наименование, ЖирныйШрифт));
			НадписьНедоступно.Добавить(Новый ФорматированнаяСтрока(","));
			НадписьНедоступно.Добавить(НадписьНоваяСтрока);
			Если Функциональность.НедоступныеКатегории.Количество() = 1 Тогда
				НадписьНедоступно.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'токен не предоставляет доступа к категории '")));
			Иначе
				НадписьНедоступно.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'токен не предоставляет доступа к категориям '")));
			КонецЕсли;
			НадписьНедоступно.Добавить(Новый ФорматированнаяСтрока(СтрСоединить(Функциональность.НедоступныеКатегории, ", "), ЖирныйШрифт));
		КонецЦикла;
	КонецЕсли;
	
	НадписьСозданиеТокена = Новый Массив;
	НадписьСозданиеТокена.Добавить(НадписьПустаяСтрока);
	НадписьСозданиеТокена.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Создать новый токен для работы с API (с доступом к категориям '")));
	НадписьСозданиеТокена.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Контент, Маркетплейс, Статистика, Документы'"), ЖирныйШрифт));
	НадписьСозданиеТокена.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = ') можно в разделе '")));
	НадписьСозданиеТокена.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Доступ к API'"),,,, "Доступ к API"));
	НадписьСозданиеТокена.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = ' вашего личного кабинета Wildberries'")));

	Элементы.ТокенВБ.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
		НадписьСостояниеТокена, НадписьКатегории, НадписьДоступно, НадписьНеДоступно, НадписьСозданиеТокена);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоговорМагазинаOzon(Организация, НастройкаИнтеграции, ДоговорКонтрагента)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НастройкаИнтеграции", НастройкаИнтеграции);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиИнтеграцииМаркетплейс.Ссылка КАК НастройкаИнтеграции
	|ИЗ
	|	Справочник.НастройкиИнтеграцииМаркетплейс КАК НастройкиИнтеграцииМаркетплейс
	|ГДЕ
	|	НастройкиИнтеграцииМаркетплейс.ВидМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыМаркетплейсов.OZON)
	|	И НастройкиИнтеграцииМаркетплейс.Владелец = &Организация
	|	И НастройкиИнтеграцииМаркетплейс.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И НастройкиИнтеграцииМаркетплейс.Ссылка <> &НастройкаИнтеграции
	|	И НЕ НастройкиИнтеграцииМаркетплейс.ПометкаУдаления";
	
	РезультатПроверки = Новый Структура("ДоговорУникален, ТекстСообщения", Истина, "");
	
	НастройкиИнтеграции = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НастройкаИнтеграции");
	Если НастройкиИнтеграции.Количество() > 0 Тогда
		Идентификаторы = Новый Массив;
		Для Каждого Настройка Из НастройкиИнтеграции Цикл
			Идентификаторы.Добавить(ИнтеграцияOzon.ПрочитатьКлиентИд(Настройка));
		КонецЦикла;
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Рекомендуется использовать отдельный договор для каждого магазина.
			|Данный договор уже используется для магазин%1 с Client Id: %2.'"),
			?(Идентификаторы.Количество() = 1, НСтр("ru = 'а'"), НСтр("ru = 'ов'")),
			СтрСоединить(Идентификаторы, ", "));
			
		РезультатПроверки.ТекстСообщения = ТекстСообщения;
		РезультатПроверки.ДоговорУникален = Ложь;
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьУникальностьИдентификатораКлиентаOZON(Организация, НастройкаИнтеграции, ИдентификаторКлиента)
	
	РезультатПроверки = Новый Структура("ИдентификаторКлиентаУникален, ТекстСообщения", Истина, "");
	Если Не ЗначениеЗаполнено(ИдентификаторКлиента) Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НастройкаИнтеграции", НастройкаИнтеграции);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиИнтеграцииМаркетплейс.Ссылка КАК НастройкаИнтеграции
	|ИЗ
	|	Справочник.НастройкиИнтеграцииМаркетплейс КАК НастройкиИнтеграцииМаркетплейс
	|ГДЕ
	|	НастройкиИнтеграцииМаркетплейс.ВидМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыМаркетплейсов.OZON)
	|	И НастройкиИнтеграцииМаркетплейс.Владелец = &Организация
	|	И НастройкиИнтеграцииМаркетплейс.Ссылка <> &НастройкаИнтеграции
	|	И НЕ НастройкиИнтеграцииМаркетплейс.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ид = ИнтеграцияOzon.ПрочитатьКлиентИд(Выборка.НастройкаИнтеграции);
		Если ВРег(СокрЛП(Ид)) = ВРег(СокрЛП(ИдентификаторКлиента)) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Для организации: %1
				|уже есть настройка интеграции с Ozon с таким же Client Id: %2'"), Организация, ИдентификаторКлиента);
			
			РезультатПроверки.ТекстСообщения = ТекстСообщения;
			РезультатПроверки.ИдентификаторКлиентаУникален = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти
